# GetVPClOvrdLineStyle

```pascal
FUNCTION GetVPClOvrdLineStyle(
				viewportHandle : HANDLE;
				className      : STRING): LONGINT;
```

```python
def vs.GetVPClOvrdLineStyle(viewportHandle, className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|className|STRING|The name of the class override.|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports